In [1]:
#THE SERIES DATA STRUCTURE

In [2]:
import pandas as pd

In [3]:
animals = ['Tiger', 'Bear', 'Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [4]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [5]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [6]:
# THE DATAFRAME DATA STRUCTURE

In [7]:
# TO MAKE A DATAFRAME USING PD.SERIES
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [8]:
# TO SHOW THE SIZE OF THE DATAFRAME
df.shape

(3, 3)

In [9]:
# TO SHOW ROWS AND COLUMNS
row,column=df.shape

In [10]:
row

3

In [11]:
column

3

In [12]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [13]:
# to get location using the loc
df.loc['Store 1']

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn

In [14]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [15]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [16]:
df.loc[:,['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [17]:
# to drop a row
df.drop('Store 1')

         Cost Item Purchased   Name
Store 2   5.0      Bird Seed  Vinod

In [18]:
#TO DISPLAY FIRST 5 VALUES IN DF
df.head()

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [19]:
#TO SHOW FIRST N VALUES USING df.head(n)
df.head(2)

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn

In [20]:
#TO SHOW LAST N VALUES USING df.tail(n)
df.tail(1)

         Cost Item Purchased   Name
Store 2   5.0      Bird Seed  Vinod

In [21]:
df[0:1]

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris

In [22]:
df[:]

         Cost Item Purchased   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [23]:
# TO SHOW THE VALUES IN COLUMNS
df.columns

Index(['Cost', 'Item Purchased', 'Name'], dtype='object')

In [24]:
df.Name

Store 1    Chris
Store 1    Kevyn
Store 2    Vinod
Name: Name, dtype: object

In [25]:
df[['Name','Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [26]:
# Max Cost value
df['Cost'].max()

22.5

In [27]:
#Min Cost value
df['Cost'].min()

2.5

In [28]:
#Describe the features
df.describe()

            Cost
count   3.000000
mean   10.000000
std    10.897247
min     2.500000
25%     3.750000
50%     5.000000
75%    13.750000
max    22.500000

In [29]:
df['Name'][df.Cost==df['Cost'].max()]

Store 1    Chris
Name: Name, dtype: object

In [30]:
# to set index

In [31]:
df.set_index('Name',inplace=True)

In [32]:
df

       Cost Item Purchased
Name
Chris  22.5       Dog Food
Kevyn   2.5   Kitty Litter
Vinod   5.0      Bird Seed

In [33]:
df.loc['Chris']

Cost                  22.5
Item Purchased    Dog Food
Name: Chris, dtype: object

In [34]:
# to reset the index
df.reset_index(inplace=True)

In [35]:
df

    Name  Cost Item Purchased
0  Chris  22.5       Dog Food
1  Kevyn   2.5   Kitty Litter
2  Vinod   5.0      Bird Seed

In [36]:
df.set_index('Cost',inplace=True)

In [37]:
df

       Name Item Purchased
Cost
22.5  Chris       Dog Food
2.5   Kevyn   Kitty Litter
5.0   Vinod      Bird Seed

In [38]:
df.loc[22.5]

Name                 Chris
Item Purchased    Dog Food
Name: 22.5, dtype: object

In [39]:
# Another way to write a dataframe
weatherdata=[('1/1/2017','32.6','rain'),('1/2/2017','35.7','sunny'),('3/2/2017','44','snow'),('1/3/2017','35.7','sunny'),('7/2/2017','44','snow')]
df=pd.DataFrame(weatherdata,columns=["day","temp","event"])
df

        day  temp  event
0  1/1/2017  32.6   rain
1  1/2/2017  35.7  sunny
2  3/2/2017    44   snow
3  1/3/2017  35.7  sunny
4  7/2/2017    44   snow

In [40]:
df.event

0     rain
1    sunny
2     snow
3    sunny
4     snow
Name: event, dtype: object

In [45]:
df

          temp  event
day
1/1/2017  32.6   rain
1/2/2017  35.7  sunny
3/2/2017    44   snow
1/3/2017  35.7  sunny
7/2/2017    44   snow

In [46]:
# to read a csv file

In [47]:
df = pd.read_csv('log.csv')
df.head(7)

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN
5  1469977544     bob  intro.html                  1    NaN     NaN
6  1469977574     bob  intro.html                  1    NaN     NaN

In [48]:
# to fill all the NaN values with 0
c=df.fillna(0)
c.head(5)

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6      0     0.0
2  1469974544  cheryl  intro.html                  9      0     0.0
3  1469974574  cheryl  intro.html                 10      0     0.0
4  1469977514     bob  intro.html                  1      0     0.0

In [49]:
# to specify which NaN values to be filled 
c=df.fillna({'paused':False,'volume':0})
c.head(5)

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6  False     0.0
2  1469974544  cheryl  intro.html                  9  False     0.0
3  1469974574  cheryl  intro.html                 10  False     0.0
4  1469977514     bob  intro.html                  1  False     0.0

In [50]:
# ffill is forward fill carries the previous value ahead 
c=df.fillna(method="ffill",limit=1)
c.head()

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6  False    10.0
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN

In [51]:
# bfill is forward fill carries the last value 
c=df.fillna(method="bfill",limit=1)
c.head()

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN

In [52]:
#dataframe.interpolate() function is basically used to fill NA values in the dataframe or series. 
c=df.interpolate()
c.head()

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN    10.0
2  1469974544  cheryl  intro.html                  9    NaN    10.0
3  1469974574  cheryl  intro.html                 10    NaN    10.0
4  1469977514     bob  intro.html                  1    NaN    10.0

In [53]:
c=df.dropna(thresh=2)
c.head()

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN

In [54]:
df = pd.read_csv('olympics.csv')
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,Summer,01 !,02 !,03 !,Total,Winter,01 !,02 !,03 !,Total,Games,01 !,02 !,03 !,Combined total
1,Afghanistan(AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [55]:
# to skip first row using skiprows=1
df = pd.read_csv('olympics.csv', index_col = 0, skiprows=1)
df.head()

,Summer,01 !,02 !,03 !,Total,Winter,01 !.1,02 !.1,03 !.1,Total.1,Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan(AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia(ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [56]:
#RENAMING THE COLUMNS
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold' + col[4:]}, inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver' + col[4:]}, inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze' + col[4:]}, inplace=True)
    if col[:1]=='':
        df.rename(columns={col:'#' + col[1:]}, inplace=True) 

df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan(AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria(ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina(ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia(ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia(ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [57]:
#Querying a DataFrame

In [58]:
# Gold value greater than 5 will be true else false
df['Gold'] >5

Afghanistan(AFG)                               False
Algeria(ALG)                                   False
Argentina(ARG)                                  True
Armenia(ARM)                                   False
Australasia(ANZ) [ANZ]                         False
Australia(AUS) [AUS] [Z]                        True
Austria(AUT)                                    True
Azerbaijan(AZE)                                 True
Bahamas(BAH)                                   False
Bahrain(BRN)                                   False
Barbados(BAR) [BAR]                            False
Belarus(BLR)                                    True
Belgium(BEL)                                    True
Bermuda(BER)                                   False
Bohemia(BOH) [BOH] [Z]                         False
Botswana(BOT)                                  False
Brazil(BRA)                                     True
British West Indies(BWI) [BWI]                 False
Bulgaria(BUL) [H]                               True
Burundi(BDI)                                   False
Cameroon(CMR)                                  False
Canada(CAN)                                     True
Chile(CHI) [I]                                 False
China(CHN) [CHN]                                True
Colombia(COL)                                  False
Costa Rica(CRC)                                False
Ivory Coast(CIV) [CIV]                         False
Croatia(CRO)                                    True
Cuba(CUB) [Z]                                   True
Cyprus(CYP)                                    False
                                                ...
Sri Lanka(SRI) [SRI]                           False
Sudan(SUD)                                     False
Suriname(SUR) [E]                              False
Sweden(SWE) [Z]                                 True
Switzerland(SUI)                                True
Syria(SYR)                                     False
Chinese Taipei(TPE) [TPE] [TPE2]               False
Tajikistan(TJK)                                False
Tanzania(TAN) [TAN]                            False
Thailand(THA)                                   True
Togo(TOG)                                      False
Tonga(TGA)                                     False
Trinidad and Tobago(TRI) [TRI]                 False
Tunisia(TUN)                                   False
Turkey(TUR)                                     True
Uganda(UGA)                                    False
Ukraine(UKR)                                    True
United Arab Emirates(UAE)                      False
United States(USA) [P] [Q] [R] [Z]              True
Uruguay(URU)                                   False
Uzbekistan(UZB)                                False
Venezuela(VEN)                                 False
Vietnam(VIE)                                   False
Virgin Islands(ISV)                            False
Yugoslavia(YUG) [YUG]                           True
Independent Olympic Participants(IOP) [IOP]    False
Zambia(ZAM) [ZAM]                              False
Zimbabwe(ZIM) [ZIM]                            False
Mixed team(ZZX) [ZZX]                           True
Totals                                           True
Name: Gold, dtype: bool

In [59]:
only_gold = df.where(df['Gold'] > 0)
only_gold.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan(AFG),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Algeria(ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina(ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia(ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia(ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0

In [60]:
only_gold['Gold'].count()

100

In [61]:
df['Gold'].count()

147

In [62]:
len(df[(df['Gold'] > 0) | (df['Gold.1'] > 0)])

101

In [63]:
df[(df['Gold.1'] > 0) & (df['Gold'] == 0)]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Liechtenstein(LIE),16,0,0,0,0,18,2,2,5,9,34,2,2,5,9